// 此文件由 geocode_locations.py 脚本自动生成
// 请勿手动编辑

const myPlaces = [
  {
    "city": "上海",
    "country": "中国",
    "lat": 31.2312707,
    "lon": 121.4700152
  },
  {
    "city": "云南昆明",
    "country": "中国",
    "lat": 25.039559,
    "lon": 102.6827416
  },
  {
    "city": "云南玉溪",
    "country": "中国",
    "lat": 24.5970338,
    "lon": 102.8436831
  },
  {
    "city": "内蒙古乌兰察布",
    "country": "中国",
    "lat": 40.9765458,
    "lon": 113.1121847
  },
  {
    "city": "内蒙古包头",
    "country": "中国",
    "lat": 40.6087866,
    "lon": 109.6365354
  },
  {
    "city": "内蒙古呼伦贝尓",
    "country": "中国",
    "lat": 48.6726509,
    "lon": 116.8185708
  },
  {
    "city": "内蒙古鄂尔多斯",
    "country": "中国",
    "lat": 39.6083548,
    "lon": 109.7882617
  },
  {
    "city": "内蒙古阿拉善盟",
    "country": "中国",
    "lat": 38.824587,
    "lon": 105.6696495
  },
  {
    "city": "北京",
    "country": "中国",
    "lat": 40.190632,
    "lon": 116.412144
  },
  {
    "city": "四川内江",
    "country": "中国",
    "lat": 29.7493188,
    "lon": 104.8541399
  },
  {
    "city": "四川宜宾",
    "country": "中国",
    "lat": 28.8476302,
    "lon": 104.6568387
  },
  {
    "city": "四川德阳",
    "country": "中国",
    "lat": 26.6032279,
    "lon": 101.8048365
  },
  {
    "city": "四川成都",
    "country": "中国",
    "lat": 30.7094122,
    "lon": 103.8596615
  },
  {
    "city": "四川自贡",
    "country": "中国",
    "lat": 29.2672707,
    "lon": 104.8360079
  },
  {
    "city": "四川资阳",
    "country": "中国",
    "lat": 36.0645184,
    "lon": 120.2981713
  },
  {
    "city": "天津",
    "country": "中国",
    "lat": 39.3032619,
    "lon": 117.4163641
  },
  {
    "city": "宁夏银川",
    "country": "中国",
    "lat": 38.197012,
    "lon": 106.6698704
  },
  {
    "city": "安徽合肥",
    "country": "中国",
    "lat": 31.866735,
    "lon": 117.1459937
  },
  {
    "city": "安徽宣城",
    "country": "中国",
    "lat": 30.9343558,
    "lon": 118.7382826
  },
  {
    "city": "安徽滁州",
    "country": "中国",
    "lat": 32.8754208,
    "lon": 117.5260591
  },
  {
    "city": "安徽黄山",
    "country": "中国",
    "lat": 29.7885345,
    "lon": 118.1903295
  },
  {
    "city": "广东广州",
    "country": "中国",
    "lat": 23.1202509,
    "lon": 113.3178641
  },
  {
    "city": "广东揭阳",
    "country": "中国",
    "lat": 25.2632506,
    "lon": 110.3143189
  },
  {
    "city": "广东汕头",
    "country": "中国",
    "lat": 23.3575408,
    "lon": 116.7736545
  },
  {
    "city": "广东深圳",
    "country": "中国",
    "lat": 22.5364119,
    "lon": 114.0504709
  },
  {
    "city": "广东清远",
    "country": "中国",
    "lat": 23.7555039,
    "lon": 113.1315388
  },
  {
    "city": "广东珠海",
    "country": "中国",
    "lat": 22.235394,
    "lon": 113.5423095
  },
  {
    "city": "广西北海",
    "country": "中国",
    "lat": 21.5047596,
    "lon": 109.2301077
  },
  {
    "city": "广西南宁",
    "country": "中国",
    "lat": 22.6887773,
    "lon": 108.3892825
  },
  {
    "city": "广西柳州",
    "country": "中国",
    "lat": 24.3224084,
    "lon": 109.3703143
  },
  {
    "city": "江苏南京",
    "country": "中国",
    "lat": 32.0750555,
    "lon": 118.7740619
  },
  {
    "city": "江苏常州",
    "country": "中国",
    "lat": 31.7375991,
    "lon": 119.6516512
  },
  {
    "city": "江苏扬州",
    "country": "中国",
    "lat": 32.2933981,
    "lon": 119.0896773
  },
  {
    "city": "江苏无锡",
    "country": "中国",
    "lat": 31.9223124,
    "lon": 120.2624783
  },
  {
    "city": "江苏苏州",
    "country": "中国",
    "lat": 31.7375991,
    "lon": 119.6516512
  },
  {
    "city": "江西上饶",
    "country": "中国",
    "lat": 28.4253474,
    "lon": 118.2023435
  },
  {
    "city": "江西南昌",
    "country": "中国",
    "lat": 28.6255621,
    "lon": 115.9559759
  },
  {
    "city": "江西赣州",
    "country": "中国",
    "lat": 28.9317827,
    "lon": 115.8356085
  },
  {
    "city": "河北唐山",
    "country": "中国",
    "lat": 39.1257285,
    "lon": 118.5420846
  },
  {
    "city": "河北张家口",
    "country": "中国",
    "lat": 39.8420603,
    "lon": 114.5805337
  },
  {
    "city": "河南洛阳",
    "country": "中国",
    "lat": 34.6763995,
    "lon": 112.3349829
  },
  {
    "city": "河南郑州",
    "country": "中国",
    "lat": 34.8166042,
    "lon": 113.5671427
  },
  {
    "city": "浙江嘉兴",
    "country": "中国",
    "lat": 30.0384656,
    "lon": 120.5313153
  },
  {
    "city": "浙江宁波",
    "country": "中国",
    "lat": 29.7587325,
    "lon": 121.9058811
  },
  {
    "city": "浙江杭州",
    "country": "中国",
    "lat": 30.3316516,
    "lon": 120.2814055
  },
  {
    "city": "浙江温州",
    "country": "中国",
    "lat": 28.1085154,
    "lon": 120.9655218
  },
  {
    "city": "浙江湖州",
    "country": "中国",
    "lat": 30.8716571,
    "lon": 120.0256251
  },
  {
    "city": "浙江绍兴",
    "country": "中国",
    "lat": 30.0384656,
    "lon": 120.5313153
  },
  {
    "city": "浙江舟山",
    "country": "中国",
    "lat": 29.9795414,
    "lon": 122.2070138
  },
  {
    "city": "海南海口",
    "country": "中国",
    "lat": 20.0597563,
    "lon": 110.1894755
  },
  {
    "city": "湖北宜昌",
    "country": "中国",
    "lat": 30.4363362,
    "lon": 111.7615833
  },
  {
    "city": "湖南长沙",
    "country": "中国",
    "lat": 28.2290273,
    "lon": 112.9949229
  },
  {
    "city": "澳门",
    "country": "中国",
    "lat": 22.1757605,
    "lon": 113.5514142
  },
  {
    "city": "甘肃兰州",
    "country": "中国",
    "lat": 36.0298924,
    "lon": 103.8119198
  },
  {
    "city": "甘肃酒泉",
    "country": "中国",
    "lat": 40.1172485,
    "lon": 94.5738913
  },
  {
    "city": "甘肃酒泉敦煌",
    "country": "中国",
    "lat": 40.1172485,
    "lon": 94.5738913
  },
  {
    "city": "福建厦门",
    "country": "中国",
    "lat": 24.4704822,
    "lon": 118.1793711
  },
  {
    "city": "福建泉州",
    "country": "中国",
    "lat": 24.9383675,
    "lon": 118.5854142
  },
  {
    "city": "福建金门",
    "country": "中国",
    "lat": 24.5554255,
    "lon": 118.2082991
  },
  {
    "city": "西藏山南",
    "country": "中国",
    "lat": 34.5890951,
    "lon": 133.7649685
  },
  {
    "city": "西藏拉萨",
    "country": "中国",
    "lat": 29.6621829,
    "lon": 91.1167169
  },
  {
    "city": "西藏林芝",
    "country": "中国",
    "lat": 29.5453462,
    "lon": 94.4416591
  },
  {
    "city": "辽宁沈阳",
    "country": "中国",
    "lat": 41.9540917,
    "lon": 123.4767206
  },
  {
    "city": "重庆",
    "country": "中国",
    "lat": 30.05518,
    "lon": 107.8748712
  },
  {
    "city": "陕西西安",
    "country": "中国",
    "lat": 34.2747143,
    "lon": 108.9760541
  },
  {
    "city": "青海海南藏族自治州",
    "country": "中国",
    "lat": 36.3365931,
    "lon": 100.4804367
  },
  {
    "city": "青海西宁",
    "country": "中国",
    "lat": 36.6177897,
    "lon": 101.7928263
  },
  {
    "city": "香港",
    "country": "中国",
    "lat": 22.350627,
    "lon": 114.1849161
  },
  {
    "city": "台中",
    "country": "中国台湾",
    "lat": 25.0378874,
    "lon": 121.513919
  },
  {
    "city": "台北",
    "country": "中国台湾",
    "lat": 25.0362092,
    "lon": 121.5137711
  },
  {
    "city": "台南",
    "country": "中国台湾",
    "lat": 25.0342751,
    "lon": 121.5089578
  },
  {
    "city": "基隆",
    "country": "中国台湾",
    "lat": 25.1553203,
    "lon": 121.7476317
  },
  {
    "city": "屏东",
    "country": "中国台湾",
    "lat": 22.9825999,
    "lon": 120.1716124
  },
  {
    "city": "彰化",
    "country": "中国台湾",
    "lat": 23.9889973,
    "lon": 120.5654864
  },
  {
    "city": "新竹",
    "country": "中国台湾",
    "lat": 24.8417605,
    "lon": 121.0010395
  },
  {
    "city": "花莲",
    "country": "中国台湾",
    "lat": 23.9867519,
    "lon": 121.6031901
  },
  {
    "city": "高雄",
    "country": "中国台湾",
    "lat": 22.5904143,
    "lon": 120.3587321
  },
  {
    "city": "哥本哈根",
    "country": "丹麦",
    "lat": 55.6867243,
    "lon": 12.5700724
  },
  {
    "city": "Batam",
    "country": "印度尼西亚",
    "lat": 1.1030815,
    "lon": 104.0383696
  },
  {
    "city": "Bintan",
    "country": "印度尼西亚",
    "lat": 1.0196577,
    "lon": 104.5698189
  },
  {
    "city": "雅典",
    "country": "希腊",
    "lat": 37.9755648,
    "lon": 23.7348324
  },
  {
    "city": "Boblingen",
    "country": "德国",
    "lat": 48.684969,
    "lon": 9.0113444
  },
  {
    "city": "慕尼黑",
    "country": "德国",
    "lat": 48.1371079,
    "lon": 11.5753822
  },
  {
    "city": "法兰克福",
    "country": "德国",
    "lat": 50.0244126,
    "lon": 8.5552003
  },
  {
    "city": "海德堡",
    "country": "德国",
    "lat": 49.4093582,
    "lon": 8.694724
  },
  {
    "city": "黑兴根",
    "country": "德国",
    "lat": 45.7684632,
    "lon": 126.8026716
  },
  {
    "city": "佛罗伦萨",
    "country": "意大利",
    "lat": 43.7697955,
    "lon": 11.2556404
  },
  {
    "city": "米兰",
    "country": "意大利",
    "lat": 45.4641943,
    "lon": 9.1896346
  },
  {
    "city": "罗马",
    "country": "意大利",
    "lat": 41.8933203,
    "lon": 12.4829321
  },
  {
    "city": "Lillehammer",
    "country": "挪威",
    "lat": 61.1333408,
    "lon": 10.4265855
  },
  {
    "city": "Ålesund",
    "country": "挪威",
    "lat": 62.4802363,
    "lon": 6.5550739
  },
  {
    "city": "卑尔根",
    "country": "挪威",
    "lat": 60.3943055,
    "lon": 5.3259192
  },
  {
    "city": "奥斯陆",
    "country": "挪威",
    "lat": 59.9133301,
    "lon": 10.7389701
  },
  {
    "city": "特隆赫姆",
    "country": "挪威",
    "lat": 63.4304475,
    "lon": 10.3952118
  },
  {
    "city": "新加坡",
    "country": "新加坡",
    "lat": 1.2899175,
    "lon": 103.8519072
  },
  {
    "city": "东京都东京市",
    "country": "日本",
    "lat": 35.6220104,
    "lon": 139.6496553
  },
  {
    "city": "京都府京都市",
    "country": "日本",
    "lat": 35.0421443,
    "lon": 135.730837
  },
  {
    "city": "佐贺县唐津市",
    "country": "日本",
    "lat": 33.4343741,
    "lon": 129.9989115
  },
  {
    "city": "冲绳县冲绳市",
    "country": "日本",
    "lat": 26.3582484,
    "lon": 127.8017085
  },
  {
    "city": "北海道函馆市",
    "country": "日本",
    "lat": 41.7646807,
    "lon": 140.7135551
  },
  {
    "city": "北海道千岁市",
    "country": "日本",
    "lat": 42.835415,
    "lon": 141.7190629
  },
  {
    "city": "北海道占冠村",
    "country": "日本",
    "lat": 42.9771763,
    "lon": 142.4124688
  },
  {
    "city": "北海道小樽市",
    "country": "日本",
    "lat": 43.2072963,
    "lon": 140.9982988
  },
  {
    "city": "北海道札幌市",
    "country": "日本",
    "lat": 43.0558424,
    "lon": 141.3344281
  },
  {
    "city": "千叶县成田市",
    "country": "日本",
    "lat": 35.8466739,
    "lon": 140.3975004
  },
  {
    "city": "埼玉县春日部市",
    "country": "日本",
    "lat": 35.964505,
    "lon": 139.744729
  },
  {
    "city": "大阪府大阪市",
    "country": "日本",
    "lat": 34.6123877,
    "lon": 135.5584942
  },
  {
    "city": "大阪府茨木市",
    "country": "日本",
    "lat": 34.8132008,
    "lon": 135.5614013
  },
  {
    "city": "奈良县奈良市",
    "country": "日本",
    "lat": 34.6827801,
    "lon": 135.829486
  },
  {
    "city": "山梨县南都留郡",
    "country": "日本",
    "lat": 35.439821,
    "lon": 138.845329
  },
  {
    "city": "熊本县山鹿市",
    "country": "日本",
    "lat": 33.08991,
    "lon": 130.8358334
  },
  {
    "city": "熊本县熊本市",
    "country": "日本",
    "lat": 32.7666309,
    "lon": 130.6893688
  },
  {
    "city": "熊本县阿苏市",
    "country": "日本",
    "lat": 32.9266504,
    "lon": 131.1094384
  },
  {
    "city": "爱媛县伊予市",
    "country": "日本",
    "lat": 33.6496891,
    "lon": 132.5771004
  },
  {
    "city": "爱媛县松山市",
    "country": "日本",
    "lat": 33.843701,
    "lon": 132.773435
  },
  {
    "city": "神奈川县厚木市",
    "country": "日本",
    "lat": 35.4397217,
    "lon": 139.2746988
  },
  {
    "city": "神奈川县小田原市",
    "country": "日本",
    "lat": 35.1961527,
    "lon": 139.1344537
  },
  {
    "city": "神奈川县海老名市",
    "country": "日本",
    "lat": 35.4484511,
    "lon": 139.3953456
  },
  {
    "city": "神奈川县箱根町",
    "country": "日本",
    "lat": 35.2102411,
    "lon": 139.0112126
  },
  {
    "city": "神奈川县藤泽市",
    "country": "日本",
    "lat": 35.3773112,
    "lon": 139.4718379
  },
  {
    "city": "神奈川县镰仓市",
    "country": "日本",
    "lat": 35.3591817,
    "lon": 139.5446
  },
  {
    "city": "福冈县久留米市",
    "country": "日本",
    "lat": 33.3142084,
    "lon": 130.5544986
  },
  {
    "city": "福冈县北九州市",
    "country": "日本",
    "lat": 33.889539,
    "lon": 130.8859097
  },
  {
    "city": "福冈县福冈市",
    "country": "日本",
    "lat": 33.598039,
    "lon": 130.367284
  },
  {
    "city": "群马县高崎市",
    "country": "日本",
    "lat": 36.3244421,
    "lon": 139.0001901
  },
  {
    "city": "茨城县取手市",
    "country": "日本",
    "lat": 35.8937981,
    "lon": 140.0628486
  },
  {
    "city": "茨城县城里町",
    "country": "日本",
    "lat": 36.4807313,
    "lon": 140.3195023
  },
  {
    "city": "茨城县水户市",
    "country": "日本",
    "lat": 36.3709421,
    "lon": 140.4874885
  },
  {
    "city": "长野县轻井泽町",
    "country": "日本",
    "lat": 36.369717,
    "lon": 138.6565298
  },
  {
    "city": "暹粒",
    "country": "柬埔寨",
    "lat": 24.9151059,
    "lon": 121.1855846
  },
  {
    "city": "金边",
    "country": "柬埔寨",
    "lat": 11.5730391,
    "lon": 104.857807
  },
  {
    "city": "斯特拉斯堡",
    "country": "法国",
    "lat": 48.584614,
    "lon": 7.7507127
  },
  {
    "city": "曼谷",
    "country": "泰国",
    "lat": 13.7524938,
    "lon": 100.4935089
  },
  {
    "city": "罗永府",
    "country": "泰国",
    "lat": 12.7943716,
    "lon": 101.3705344
  },
  {
    "city": "玛尔摩",
    "country": "瑞典",
    "lat": 55.6052931,
    "lon": 13.0001566
  },
  {
    "city": "Zermatt",
    "country": "瑞士",
    "lat": 46.0212076,
    "lon": 7.749254
  },
  {
    "city": "卢塞恩",
    "country": "瑞士",
    "lat": 47.0505452,
    "lon": 8.3054682
  },
  {
    "city": "沙夫豪森",
    "country": "瑞士",
    "lat": 47.6960491,
    "lon": 8.634513
  },
  {
    "city": "泰施",
    "country": "瑞士",
    "lat": 46.9573493,
    "lon": 7.4524617
  },
  {
    "city": "苏黎世",
    "country": "瑞士",
    "lat": 47.3744489,
    "lon": 8.5410422
  },
  {
    "city": "西雅图",
    "country": "美国",
    "lat": 47.6038321,
    "lon": -122.330062
  },
  {
    "city": "伦敦",
    "country": "英国",
    "lat": 51.4893335,
    "lon": -0.1440551
  },
  {
    "city": "岘港",
    "country": "越南",
    "lat": 16.0715831,
    "lon": 108.2092693
  },
  {
    "city": "胡志明",
    "country": "越南",
    "lat": 10.7763897,
    "lon": 106.7011391
  },
  {
    "city": "迪拜",
    "country": "阿联酋",
    "lat": 39.9094436,
    "lon": 116.1403973
  },
  {
    "city": "阿布扎比阿布扎比",
    "country": "阿联酋",
    "lat": 24.4407588,
    "lon": 54.371427
  },
  {
    "city": "吉隆坡",
    "country": "马来西亚",
    "lat": 3.1526589,
    "lon": 101.7022205
  }
];