// 此文件由 geocode_locations.py 脚本自动生成
// 请勿手动编辑

const myPlaces = [
  {
    "city": "Abu Dhabi, Abu Dhabi, United Arab Emirates",
    "lat": 24.4538352,
    "lon": 54.3774014
  },
  {
    "city": "Al Ain, Abu Dhabi, United Arab Emirates",
    "lat": 24.2248697,
    "lon": 55.7452211
  },
  {
    "city": "Athens, Attica, Greece",
    "lat": 37.9755648,
    "lon": 23.7348324
  },
  {
    "city": "Bangkok, Thailand",
    "lat": 13.7524938,
    "lon": 100.4935089
  },
  {
    "city": "Batam, Indonesia",
    "lat": 1.1030815,
    "lon": 104.0383696
  },
  {
    "city": "Bergen, Vestland, Norway",
    "lat": 60.3943055,
    "lon": 5.3259192
  },
  {
    "city": "Bintan, Indonesia",
    "lat": 1.0196577,
    "lon": 104.5698189
  },
  {
    "city": "Böblingen, Baden-Württemberg, Germany",
    "lat": 48.684969,
    "lon": 9.0113444
  },
  {
    "city": "Copenhagen, Capital Region of Denmark, Denmark",
    "lat": 55.6867243,
    "lon": 12.5700724
  },
  {
    "city": "Da Nang, Vietnam",
    "lat": 16.068,
    "lon": 108.212
  },
  {
    "city": "Dubai, Dubai, United Arab Emirates",
    "lat": 25.0742823,
    "lon": 55.1885387
  },
  {
    "city": "Florence, Tuscany, Italy",
    "lat": 43.7697955,
    "lon": 11.2556404
  },
  {
    "city": "Frankfurt, Hesse, Germany",
    "lat": 50.1106444,
    "lon": 8.6820917
  },
  {
    "city": "Hechingen, Baden-Württemberg, Germany",
    "lat": 48.3525529,
    "lon": 8.9642047
  },
  {
    "city": "Heidelberg, Baden-Württemberg, Germany",
    "lat": 49.4093582,
    "lon": 8.694724
  },
  {
    "city": "Ho Chi Minh City, Vietnam",
    "lat": 10.7755254,
    "lon": 106.7021047
  },
  {
    "city": "Kuala Lumpur, Malaysia",
    "lat": 3.1526589,
    "lon": 101.7022205
  },
  {
    "city": "Lillehammer, Innlandet, Norway",
    "lat": 61.1333408,
    "lon": 10.4265855
  },
  {
    "city": "London, England, United Kingdom",
    "lat": 51.5074456,
    "lon": -0.1277653
  },
  {
    "city": "Lucerne, Lucerne, Switzerland",
    "lat": 47.0505452,
    "lon": 8.3054682
  },
  {
    "city": "Malmö, Skåne, Sweden",
    "lat": 55.6052931,
    "lon": 13.0001566
  },
  {
    "city": "Milan, Lombardy, Italy",
    "lat": 45.4641943,
    "lon": 9.1896346
  },
  {
    "city": "Munich, Bavaria, Germany",
    "lat": 48.1371079,
    "lon": 11.5753822
  },
  {
    "city": "Oslo, Oslo, Norway",
    "lat": 59.9723975,
    "lon": 10.7757292
  },
  {
    "city": "Phnom Penh, Cambodia",
    "lat": 11.5730391,
    "lon": 104.857807
  },
  {
    "city": "Rayong, Thailand",
    "lat": 12.6817905,
    "lon": 101.277765
  },
  {
    "city": "Roma, Italy",
    "lat": 41.8933203,
    "lon": 12.4829321
  },
  {
    "city": "Schaffhausen, Schaffhausen, Switzerland",
    "lat": 47.6960491,
    "lon": 8.634513
  },
  {
    "city": "Seattle, Washington, United States",
    "lat": 47.6038321,
    "lon": -122.330062
  },
  {
    "city": "Siem Reap, Cambodia",
    "lat": 13.3617562,
    "lon": 103.8590321
  },
  {
    "city": "Singapore, Singapore",
    "lat": 1.2899175,
    "lon": 103.8519072
  },
  {
    "city": "Strasbourg, Grand Est, France",
    "lat": 48.584614,
    "lon": 7.7507127
  },
  {
    "city": "Stuttgart, Baden-Württemberg, Germany",
    "lat": 48.7784485,
    "lon": 9.1800132
  },
  {
    "city": "Trondheim, Trøndelag, Norway",
    "lat": 63.4304475,
    "lon": 10.3952118
  },
  {
    "city": "Täsch, Valais, Switzerland",
    "lat": 46.0676751,
    "lon": 7.7770173
  },
  {
    "city": "Vatican City, Vatican City",
    "lat": 41.9034912,
    "lon": 12.4528349
  },
  {
    "city": "Zermatt, Valais, Switzerland",
    "lat": 46.0212076,
    "lon": 7.749254
  },
  {
    "city": "Zurich, Zurich, Switzerland",
    "lat": 47.3744489,
    "lon": 8.5410422
  },
  {
    "city": "Ålesund, Møre og Romsdal, Norway",
    "lat": 62.4802363,
    "lon": 6.5550739
  },
  {
    "city": "三亚市, 海南省, 中国",
    "lat": 18.2534658,
    "lon": 109.5034392
  },
  {
    "city": "三浦市 神奈川県, 日本",
    "lat": 35.1441984,
    "lon": 139.6207589
  },
  {
    "city": "上海市, 上海市, 中国",
    "lat": 31.2323437,
    "lon": 121.4691024
  },
  {
    "city": "上饶市, 江西省, 中国",
    "lat": 28.7435852,
    "lon": 117.40539
  },
  {
    "city": "中央区, 東京都, 日本",
    "lat": 35.6706436,
    "lon": 139.7719923
  },
  {
    "city": "中野区, 東京都, 日本",
    "lat": 35.7077741,
    "lon": 139.6638239
  },
  {
    "city": "久留米市, 福岡県, 日本",
    "lat": 33.3196545,
    "lon": 130.5080625
  },
  {
    "city": "乌兰察布市, 内蒙古自治区, 中国",
    "lat": 40.9902685,
    "lon": 113.1315646
  },
  {
    "city": "京都市, 京都府, 日本",
    "lat": 35.0115754,
    "lon": 135.7681441
  },
  {
    "city": "伊予市, 愛媛県, 日本",
    "lat": 33.7578962,
    "lon": 132.7039458
  },
  {
    "city": "兰州市, 甘肃省, 中国",
    "lat": 36.474436,
    "lon": 103.733224
  },
  {
    "city": "内江市, 四川省, 中国",
    "lat": 29.5827261,
    "lon": 105.054491
  },
  {
    "city": "函館市, 北海道, 日本",
    "lat": 41.768793,
    "lon": 140.729008
  },
  {
    "city": "包头市, 内蒙古自治区, 中国",
    "lat": 40.6174777,
    "lon": 109.944912
  },
  {
    "city": "北九州市, 福岡県, 日本",
    "lat": 33.8829996,
    "lon": 130.8749015
  },
  {
    "city": "北京市, 北京市, 中国",
    "lat": 39.9057136,
    "lon": 116.3912972
  },
  {
    "city": "北海市, 广西壮族自治区, 中国",
    "lat": 21.6740808,
    "lon": 109.3729721
  },
  {
    "city": "千代田区, 東京都, 日本",
    "lat": 35.6938097,
    "lon": 139.7532163
  },
  {
    "city": "千歳市, 北海道, 日本",
    "lat": 42.8209335,
    "lon": 141.6509612
  },
  {
    "city": "南京市, 江苏省, 中国",
    "lat": 32.0438284,
    "lon": 118.7788631
  },
  {
    "city": "南宁市, 广西壮族自治区, 中国",
    "lat": 22.8193063,
    "lon": 108.3627211
  },
  {
    "city": "南巨摩郡, 山梨県, 日本",
    "lat": 35.4178925,
    "lon": 138.4471491
  },
  {
    "city": "南昌市, 江西省, 中国",
    "lat": 28.6472124,
    "lon": 116.0348483
  },
  {
    "city": "南都留郡, 山梨県, 日本",
    "lat": 35.4791499,
    "lon": 138.7411672
  },
  {
    "city": "占冠村, 北海道, 日本",
    "lat": 42.9799698,
    "lon": 142.3980624
  },
  {
    "city": "厚木市, 神奈川県, 日本",
    "lat": 35.4429646,
    "lon": 139.3625125
  },
  {
    "city": "厦门市, 福建省, 中国",
    "lat": 24.5438732,
    "lon": 118.0768065
  },
  {
    "city": "取手市, 茨城県, 日本",
    "lat": 35.9112034,
    "lon": 140.0500352
  },
  {
    "city": "台中, 台湾",
    "lat": 24.1121054,
    "lon": 120.6158968
  },
  {
    "city": "台北, 台湾",
    "lat": 25.0375198,
    "lon": 121.5636796
  },
  {
    "city": "台南, 台湾",
    "lat": 22.9971954,
    "lon": 120.2130772
  },
  {
    "city": "合肥市, 安徽省, 中国",
    "lat": 31.8665676,
    "lon": 117.281428
  },
  {
    "city": "唐山市, 河北省, 中国",
    "lat": 39.6295951,
    "lon": 118.1738712
  },
  {
    "city": "唐津市, 佐賀県, 日本",
    "lat": 33.4503405,
    "lon": 129.9679345
  },
  {
    "city": "嘉兴市, 浙江省, 中国",
    "lat": 30.7474425,
    "lon": 120.7510971
  },
  {
    "city": "城里町, 茨城県, 日本",
    "lat": 36.4796757,
    "lon": 140.3760465
  },
  {
    "city": "基隆, 台湾",
    "lat": 25.1317232,
    "lon": 121.744652
  },
  {
    "city": "塩尻市, 長野県, 日本",
    "lat": 36.124957,
    "lon": 137.952801
  },
  {
    "city": "墨田区, 東京都, 日本",
    "lat": 35.7104196,
    "lon": 139.8017421
  },
  {
    "city": "大田区, 東京都, 日本",
    "lat": 35.561206,
    "lon": 139.715843
  },
  {
    "city": "大阪市, 大阪府, 日本",
    "lat": 34.6937569,
    "lon": 135.5014539
  },
  {
    "city": "天津市, 天津市, 中国",
    "lat": 39.0844897,
    "lon": 117.1956724
  },
  {
    "city": "奈良市, 奈良県, 日本",
    "lat": 34.6845445,
    "lon": 135.8048359
  },
  {
    "city": "宁波市, 浙江省, 中国",
    "lat": 29.8622194,
    "lon": 121.6203873
  },
  {
    "city": "宜宾市, 四川省, 中国",
    "lat": 28.58689,
    "lon": 104.718661
  },
  {
    "city": "宜昌市, 湖北省, 中国",
    "lat": 30.6941332,
    "lon": 111.2803512
  },
  {
    "city": "宣城市, 安徽省, 中国",
    "lat": 30.9412541,
    "lon": 118.7540167
  },
  {
    "city": "小樽市, 北海道, 日本",
    "lat": 43.1906806,
    "lon": 140.9946021
  },
  {
    "city": "小田原市, 神奈川県, 日本",
    "lat": 35.2645301,
    "lon": 139.152246
  },
  {
    "city": "屏东县恒春镇, 台湾",
    "lat": 21.9001084,
    "lon": 120.8547379
  },
  {
    "city": "山南市, 西藏自治区, 中国",
    "lat": 28.7628486,
    "lon": 91.7523138
  },
  {
    "city": "山鹿市, 熊本県, 日本",
    "lat": 33.0177456,
    "lon": 130.6911907
  },
  {
    "city": "常州市, 江苏省, 中国",
    "lat": 31.8122623,
    "lon": 119.9691539
  },
  {
    "city": "广州市, 广东省, 中国",
    "lat": 23.1301964,
    "lon": 113.2592945
  },
  {
    "city": "张家口市, 河北省, 中国",
    "lat": 40.8171433,
    "lon": 114.8782861
  },
  {
    "city": "彰化, 台湾",
    "lat": 24.081673,
    "lon": 120.538205
  },
  {
    "city": "德阳市, 四川省, 中国",
    "lat": 31.1244028,
    "lon": 104.39013
  },
  {
    "city": "成田市, 千葉県, 日本",
    "lat": 35.7767683,
    "lon": 140.3183376
  },
  {
    "city": "成都市, 四川省, 中国",
    "lat": 30.659867,
    "lon": 104.063315
  },
  {
    "city": "扬州市, 江苏省, 中国",
    "lat": 32.3968554,
    "lon": 119.4077658
  },
  {
    "city": "拉萨市, 西藏自治区, 中国",
    "lat": 29.6542054,
    "lon": 91.1173015
  },
  {
    "city": "揭阳市, 广东省, 中国",
    "lat": 23.553156,
    "lon": 116.3680354
  },
  {
    "city": "敦煌市, 甘肃省, 中国",
    "lat": 40.1411004,
    "lon": 94.6607593
  },
  {
    "city": "新宿区, 東京都, 日本",
    "lat": 35.6937632,
    "lon": 139.7036319
  },
  {
    "city": "新竹, 台湾",
    "lat": 24.8014026,
    "lon": 120.971678
  },
  {
    "city": "无锡市, 江苏省, 中国",
    "lat": 31.5776626,
    "lon": 120.2952752
  },
  {
    "city": "昆明市, 云南省, 中国",
    "lat": 25.0363006,
    "lon": 102.7086139
  },
  {
    "city": "春日部市, 埼玉県, 日本",
    "lat": 35.9757957,
    "lon": 139.752019
  },
  {
    "city": "札幌市, 北海道, 日本",
    "lat": 43.061936,
    "lon": 141.3542924
  },
  {
    "city": "杭州市, 浙江省, 中国",
    "lat": 30.2489634,
    "lon": 120.2052342
  },
  {
    "city": "松山市, 愛媛県, 日本",
    "lat": 33.8395188,
    "lon": 132.7653521
  },
  {
    "city": "林芝市, 西藏自治区, 中国",
    "lat": 29.5487912,
    "lon": 94.6384738
  },
  {
    "city": "柳州市, 广西壮族自治区, 中国",
    "lat": 25.0009993,
    "lon": 109.3414252
  },
  {
    "city": "水戸市, 茨城県, 日本",
    "lat": 36.3659174,
    "lon": 140.4731743
  },
  {
    "city": "汕头市, 广东省, 中国",
    "lat": 23.3563921,
    "lon": 116.6775856
  },
  {
    "city": "江户川区, 東京都, 日本",
    "lat": 35.7066318,
    "lon": 139.868677
  },
  {
    "city": "沈阳市, 辽宁省, 中国",
    "lat": 41.8026095,
    "lon": 123.4279105
  },
  {
    "city": "沖縄市, 沖縄県, 日本",
    "lat": 26.3343738,
    "lon": 127.8056597
  },
  {
    "city": "泉州市, 福建省, 中国",
    "lat": 25.1901863,
    "lon": 118.338717
  },
  {
    "city": "洛阳市, 河南省, 中国",
    "lat": 34.6196539,
    "lon": 112.4477046
  },
  {
    "city": "海南藏族自治州, 青海省, 中国",
    "lat": 35.8172501,
    "lon": 100.3405266
  },
  {
    "city": "海口市, 海南省, 中国",
    "lat": 20.0462328,
    "lon": 110.1956502
  },
  {
    "city": "海拉尔区, 内蒙古自治区, 中国",
    "lat": 49.2321432,
    "lon": 119.817227
  },
  {
    "city": "海老名市, 神奈川県, 日本",
    "lat": 35.4464147,
    "lon": 139.3906427
  },
  {
    "city": "深圳市, 广东省, 中国",
    "lat": 22.5445741,
    "lon": 114.0545429
  },
  {
    "city": "清远市, 广东省, 中国",
    "lat": 23.6832984,
    "lon": 113.0505994
  },
  {
    "city": "渋谷区, 東京都, 日本",
    "lat": 35.6633709,
    "lon": 139.6964952
  },
  {
    "city": "温州市, 浙江省, 中国",
    "lat": 27.9963899,
    "lon": 120.695345
  },
  {
    "city": "港区, 東京都, 日本",
    "lat": 35.6580089,
    "lon": 139.7515137
  },
  {
    "city": "湖州市, 浙江省, 中国",
    "lat": 30.8942995,
    "lon": 120.0851114
  },
  {
    "city": "滁州市, 安徽省, 中国",
    "lat": 32.3027377,
    "lon": 118.3139455
  },
  {
    "city": "满洲里市, 内蒙古自治区, 中国",
    "lat": 49.5914042,
    "lon": 117.4464324
  },
  {
    "city": "澳门特别行政区, 中国",
    "lat": 22.1757605,
    "lon": 113.5514142
  },
  {
    "city": "熊本市, 熊本県, 日本",
    "lat": 32.8033909,
    "lon": 130.7082737
  },
  {
    "city": "玉溪市, 云南省, 中国",
    "lat": 24.3511487,
    "lon": 102.527044
  },
  {
    "city": "珠海市, 广东省, 中国",
    "lat": 22.273734,
    "lon": 113.5721327
  },
  {
    "city": "目黑区, 東京都, 日本",
    "lat": 35.6412891,
    "lon": 139.6983834
  },
  {
    "city": "福岡市, 福岡県, 日本",
    "lat": 33.5898988,
    "lon": 130.4017509
  },
  {
    "city": "箱根町, 神奈川県, 日本",
    "lat": 35.2323662,
    "lon": 139.1068849
  },
  {
    "city": "绍兴市, 浙江省, 中国",
    "lat": 29.9992425,
    "lon": 120.576854
  },
  {
    "city": "绵阳市, 四川省, 中国",
    "lat": 31.4602714,
    "lon": 104.7160723
  },
  {
    "city": "自贡市, 四川省, 中国",
    "lat": 29.2995746,
    "lon": 104.6928392
  },
  {
    "city": "舟山市, 浙江省, 中国",
    "lat": 29.9873344,
    "lon": 122.2030363
  },
  {
    "city": "花莲, 台湾",
    "lat": 23.9926399,
    "lon": 121.6009524
  },
  {
    "city": "苏州市, 江苏省, 中国",
    "lat": 31.311123,
    "lon": 120.6212881
  },
  {
    "city": "茨木市, 大阪府, 日本",
    "lat": 34.8161302,
    "lon": 135.5685528
  },
  {
    "city": "藤沢市, 神奈川県, 日本",
    "lat": 35.3388615,
    "lon": 139.4909335
  },
  {
    "city": "西宁市, 青海省, 中国",
    "lat": 36.824463,
    "lon": 101.440811
  },
  {
    "city": "西安市, 陕西省, 中国",
    "lat": 34.261004,
    "lon": 108.9423363
  },
  {
    "city": "諏訪市, 長野県, 日本",
    "lat": 36.0391748,
    "lon": 138.11398
  },
  {
    "city": "资阳市, 四川省, 中国",
    "lat": 30.0928618,
    "lon": 105.1336656
  },
  {
    "city": "赣州市, 江西省, 中国",
    "lat": 25.703866,
    "lon": 115.348216
  },
  {
    "city": "足立区, 東京都, 日本",
    "lat": 35.7746029,
    "lon": 139.8045163
  },
  {
    "city": "軽井沢町, 長野県, 日本",
    "lat": 36.3482938,
    "lon": 138.5969968
  },
  {
    "city": "郑州市, 河南省, 中国",
    "lat": 34.7472531,
    "lon": 113.619321
  },
  {
    "city": "鄂尔多斯市, 内蒙古自治区, 中国",
    "lat": 39.4602947,
    "lon": 108.8134284
  },
  {
    "city": "酒泉市, 甘肃省, 中国",
    "lat": 40.2773513,
    "lon": 96.4560478
  },
  {
    "city": "重庆市, 重庆市, 中国",
    "lat": 29.5656729,
    "lon": 106.5479189
  },
  {
    "city": "金门县, 福建省, 中国",
    "lat": 24.4360383,
    "lon": 118.3139699
  },
  {
    "city": "鎌倉市, 神奈川県, 日本",
    "lat": 35.3192808,
    "lon": 139.5469627
  },
  {
    "city": "银川市, 宁夏回族自治区, 中国",
    "lat": 38.4852037,
    "lon": 106.2261926
  },
  {
    "city": "长沙市, 湖南省, 中国",
    "lat": 28.1450774,
    "lon": 113.2384362
  },
  {
    "city": "阿拉善盟, 内蒙古自治区, 中国",
    "lat": 40.480869,
    "lon": 102.84579
  },
  {
    "city": "阿蘇市, 熊本県, 日本",
    "lat": 32.9524903,
    "lon": 131.1214674
  },
  {
    "city": "额尔古纳市, 内蒙古自治区, 中国",
    "lat": 51.67179,
    "lon": 120.781386
  },
  {
    "city": "香港特别行政区, 中国",
    "lat": 22.350627,
    "lon": 114.1849161
  },
  {
    "city": "高崎市, 群馬県, 日本",
    "lat": 36.3220984,
    "lon": 139.0032758
  },
  {
    "city": "高雄, 台湾",
    "lat": 22.6395321,
    "lon": 120.3025585
  },
  {
    "city": "黄山市, 安徽省, 中国",
    "lat": 29.7172627,
    "lon": 118.3324811
  }
];