// 此文件由 geocode_locations.py 脚本自动生成
// 请勿手动编辑

const myPlaces = [
  {
    "city": "上海",
    "country": "中国",
    "lat": 31.2312707,
    "lon": 121.4700152
  },
  {
    "city": "云南昆明",
    "country": "中国",
    "lat": 25.0363006,
    "lon": 102.7086139
  },
  {
    "city": "云南玉溪",
    "country": "中国",
    "lat": 23.0600474,
    "lon": 120.2525905
  },
  {
    "city": "内蒙古乌兰察布",
    "country": "中国",
    "lat": 40.9902685,
    "lon": 113.1315646
  },
  {
    "city": "内蒙古包头",
    "country": "中国",
    "lat": 40.6174777,
    "lon": 109.944912
  },
  {
    "city": "内蒙古呼伦贝尓海拉尔",
    "country": "中国",
    "lat": 49.2100482,
    "lon": 119.7504262
  },
  {
    "city": "内蒙古呼伦贝尓满洲里",
    "country": "中国",
    "lat": 49.5841146,
    "lon": 117.44403
  },
  {
    "city": "内蒙古鄂尔多斯",
    "country": "中国",
    "lat": 39.4602947,
    "lon": 108.8134284
  },
  {
    "city": "内蒙古阿拉善盟",
    "country": "中国",
    "lat": 40.480869,
    "lon": 102.84579
  },
  {
    "city": "北京",
    "country": "中国",
    "lat": 40.190632,
    "lon": 116.412144
  },
  {
    "city": "四川德阳",
    "country": "中国",
    "lat": 32.8569953,
    "lon": 130.7928238
  },
  {
    "city": "天津",
    "country": "中国",
    "lat": 39.3032619,
    "lon": 117.4163641
  },
  {
    "city": "宁夏银川",
    "country": "中国",
    "lat": 38.4852037,
    "lon": 106.2261926
  },
  {
    "city": "安徽合肥",
    "country": "中国",
    "lat": 31.8665676,
    "lon": 117.281428
  },
  {
    "city": "安徽宣城",
    "country": "中国",
    "lat": 30.9412541,
    "lon": 118.7540167
  },
  {
    "city": "安徽滁州",
    "country": "中国",
    "lat": 32.3027377,
    "lon": 118.3139455
  },
  {
    "city": "安徽黄山",
    "country": "中国",
    "lat": 29.7172627,
    "lon": 118.3324811
  },
  {
    "city": "广东广州",
    "country": "中国",
    "lat": 23.1301964,
    "lon": 113.2592945
  },
  {
    "city": "广东揭阳",
    "country": "中国",
    "lat": 29.0860719,
    "lon": 119.6593357
  },
  {
    "city": "广东汕头",
    "country": "中国",
    "lat": 30.4791732,
    "lon": 114.3892679
  },
  {
    "city": "广东深圳",
    "country": "中国",
    "lat": 22.5445741,
    "lon": 114.0545429
  },
  {
    "city": "广东清远",
    "country": "中国",
    "lat": 22.55212,
    "lon": 107.8310295
  },
  {
    "city": "广东珠海",
    "country": "中国",
    "lat": 22.273734,
    "lon": 113.5721327
  },
  {
    "city": "广西北海",
    "country": "中国",
    "lat": 21.6740808,
    "lon": 109.3729721
  },
  {
    "city": "广西南宁",
    "country": "中国",
    "lat": 22.8193063,
    "lon": 108.3627211
  },
  {
    "city": "广西柳州",
    "country": "中国",
    "lat": 25.0009993,
    "lon": 109.3414252
  },
  {
    "city": "江苏南京",
    "country": "中国",
    "lat": 32.0438284,
    "lon": 118.7788631
  },
  {
    "city": "江苏常州",
    "country": "中国",
    "lat": 31.8122623,
    "lon": 119.9691539
  },
  {
    "city": "江苏扬州",
    "country": "中国",
    "lat": 32.3968554,
    "lon": 119.4077658
  },
  {
    "city": "江苏无锡",
    "country": "中国",
    "lat": 31.5776626,
    "lon": 120.2952752
  },
  {
    "city": "江苏苏州",
    "country": "中国",
    "lat": 31.8665676,
    "lon": 117.281428
  },
  {
    "city": "江西上饶",
    "country": "中国",
    "lat": 28.7435852,
    "lon": 117.40539
  },
  {
    "city": "江西南昌",
    "country": "中国",
    "lat": 28.6472124,
    "lon": 116.0348483
  },
  {
    "city": "江西赣州",
    "country": "中国",
    "lat": 25.703866,
    "lon": 115.348216
  },
  {
    "city": "河北唐山",
    "country": "中国",
    "lat": 39.6266589,
    "lon": 118.1407666
  },
  {
    "city": "河北张家口",
    "country": "中国",
    "lat": 40.1533225,
    "lon": 118.2978109
  },
  {
    "city": "河南洛阳",
    "country": "中国",
    "lat": 34.6367974,
    "lon": 112.3921623
  },
  {
    "city": "河南郑州",
    "country": "中国",
    "lat": 34.7835208,
    "lon": 113.6386495
  },
  {
    "city": "浙江嘉兴",
    "country": "中国",
    "lat": 30.7474425,
    "lon": 120.7510971
  },
  {
    "city": "浙江宁波",
    "country": "中国",
    "lat": 29.8622194,
    "lon": 121.6203873
  },
  {
    "city": "浙江杭州",
    "country": "中国",
    "lat": 30.2489634,
    "lon": 120.2052342
  },
  {
    "city": "浙江温州",
    "country": "中国",
    "lat": 27.9963899,
    "lon": 120.695345
  },
  {
    "city": "浙江湖州",
    "country": "中国",
    "lat": 30.8942995,
    "lon": 120.0851114
  },
  {
    "city": "浙江绍兴",
    "country": "中国",
    "lat": 29.9992425,
    "lon": 120.576854
  },
  {
    "city": "浙江舟山",
    "country": "中国",
    "lat": 29.9873344,
    "lon": 122.2030363
  },
  {
    "city": "海南海口",
    "country": "中国",
    "lat": 20.0462328,
    "lon": 110.1956502
  },
  {
    "city": "海南省三亚市",
    "country": "中国",
    "lat": 18.2665551,
    "lon": 109.501877
  },
  {
    "city": "湖北宜昌",
    "country": "中国",
    "lat": 30.6941332,
    "lon": 111.2803512
  },
  {
    "city": "湖南长沙",
    "country": "中国",
    "lat": 28.1450774,
    "lon": 113.2384362
  },
  {
    "city": "澳门",
    "country": "中国",
    "lat": 22.1757605,
    "lon": 113.5514142
  },
  {
    "city": "甘肃兰州",
    "country": "中国",
    "lat": 36.474436,
    "lon": 103.733224
  },
  {
    "city": "甘肃酒泉",
    "country": "中国",
    "lat": 40.2773513,
    "lon": 96.4560478
  },
  {
    "city": "甘肃酒泉敦煌",
    "country": "中国",
    "lat": 40.1411004,
    "lon": 94.6607593
  },
  {
    "city": "福建厦门",
    "country": "中国",
    "lat": 24.5438732,
    "lon": 118.0768065
  },
  {
    "city": "福建泉州",
    "country": "中国",
    "lat": 25.1901863,
    "lon": 118.338717
  },
  {
    "city": "福建金门",
    "country": "中国",
    "lat": 24.4466773,
    "lon": 118.200187
  },
  {
    "city": "西藏山南",
    "country": "中国",
    "lat": 28.7628486,
    "lon": 91.7523138
  },
  {
    "city": "西藏拉萨",
    "country": "中国",
    "lat": 29.6542054,
    "lon": 91.1173015
  },
  {
    "city": "西藏林芝",
    "country": "中国",
    "lat": 29.5487912,
    "lon": 94.6384738
  },
  {
    "city": "辽宁沈阳",
    "country": "中国",
    "lat": 41.8026095,
    "lon": 123.4279105
  },
  {
    "city": "重庆",
    "country": "中国",
    "lat": 30.05518,
    "lon": 107.8748712
  },
  {
    "city": "陕西西安",
    "country": "中国",
    "lat": 34.261004,
    "lon": 108.9423363
  },
  {
    "city": "青海海南藏族自治州",
    "country": "中国",
    "lat": 35.8172501,
    "lon": 100.3405266
  },
  {
    "city": "青海西宁",
    "country": "中国",
    "lat": 36.824463,
    "lon": 101.440811
  },
  {
    "city": "香港",
    "country": "中国",
    "lat": 22.350627,
    "lon": 114.1849161
  },
  {
    "city": "台中",
    "country": "中国台湾",
    "lat": 32.1148436,
    "lon": 112.1762685
  },
  {
    "city": "台北",
    "country": "中国台湾",
    "lat": 22.2729501,
    "lon": 114.1738292
  },
  {
    "city": "台南",
    "country": "中国台湾",
    "lat": 22.2217813,
    "lon": 114.1148867
  },
  {
    "city": "基隆",
    "country": "中国台湾",
    "lat": 39.9252939,
    "lon": 119.5698059
  },
  {
    "city": "屏东县恒春镇",
    "country": "中国台湾",
    "lat": 22.0017382,
    "lon": 120.7476631
  },
  {
    "city": "彰化",
    "country": "中国台湾",
    "lat": 30.3933305,
    "lon": 120.2759866
  },
  {
    "city": "新竹",
    "country": "中国台湾",
    "lat": 22.3103098,
    "lon": 114.1908672
  },
  {
    "city": "花莲",
    "country": "中国台湾",
    "lat": 22.2794583,
    "lon": 114.19292
  },
  {
    "city": "高雄",
    "country": "中国台湾",
    "lat": 30.0918556,
    "lon": 105.5018646
  },
  {
    "city": "哥本哈根",
    "country": "丹麦",
    "lat": 55.6867243,
    "lon": 12.5700724
  },
  {
    "city": "雅典",
    "country": "希腊",
    "lat": 37.9755648,
    "lon": 23.7348324
  },
  {
    "city": "慕尼黑",
    "country": "德国",
    "lat": 48.1371079,
    "lon": 11.5753822
  },
  {
    "city": "法兰克福",
    "country": "德国",
    "lat": 50.1106444,
    "lon": 8.6820917
  },
  {
    "city": "海德堡",
    "country": "德国",
    "lat": 49.4093582,
    "lon": 8.694724
  },
  {
    "city": "佛罗伦萨",
    "country": "意大利",
    "lat": 43.7697955,
    "lon": 11.2556404
  },
  {
    "city": "米兰",
    "country": "意大利",
    "lat": 45.4641943,
    "lon": 9.1896346
  },
  {
    "city": "罗马",
    "country": "意大利",
    "lat": 41.8933203,
    "lon": 12.4829321
  },
  {
    "city": "卑尔根",
    "country": "挪威",
    "lat": 60.3943055,
    "lon": 5.3259192
  },
  {
    "city": "奥斯陆",
    "country": "挪威",
    "lat": 59.9133301,
    "lon": 10.7389701
  },
  {
    "city": "特隆赫姆",
    "country": "挪威",
    "lat": 63.4304475,
    "lon": 10.3952118
  },
  {
    "city": "新加坡",
    "country": "新加坡",
    "lat": 1.2899175,
    "lon": 103.8519072
  },
  {
    "city": "东京都东京市",
    "country": "日本",
    "lat": 35.6220104,
    "lon": 139.6496553
  },
  {
    "city": "京都府京都市",
    "country": "日本",
    "lat": 35.0421443,
    "lon": 135.730837
  },
  {
    "city": "佐贺县唐津市",
    "country": "日本",
    "lat": 33.4503405,
    "lon": 129.9679345
  },
  {
    "city": "冲绳县冲绳市",
    "country": "日本",
    "lat": 26.21802,
    "lon": 127.6828462
  },
  {
    "city": "北海道函馆市",
    "country": "日本",
    "lat": 41.7646807,
    "lon": 140.7135551
  },
  {
    "city": "北海道千岁市",
    "country": "日本",
    "lat": 42.8209335,
    "lon": 141.6509612
  },
  {
    "city": "北海道占冠村",
    "country": "日本",
    "lat": 42.9799698,
    "lon": 142.3980624
  },
  {
    "city": "北海道小樽市",
    "country": "日本",
    "lat": 43.1906806,
    "lon": 140.9946021
  },
  {
    "city": "北海道札幌市",
    "country": "日本",
    "lat": 43.0558424,
    "lon": 141.3344281
  },
  {
    "city": "千叶县成田市",
    "country": "日本",
    "lat": 35.7767683,
    "lon": 140.3183376
  },
  {
    "city": "埼玉县春日部市",
    "country": "日本",
    "lat": 35.9757957,
    "lon": 139.752019
  },
  {
    "city": "大阪府大阪市",
    "country": "日本",
    "lat": 34.6782172,
    "lon": 135.5007926
  },
  {
    "city": "大阪府茨木市",
    "country": "日本",
    "lat": 34.8303712,
    "lon": 135.5500473
  },
  {
    "city": "奈良县奈良市",
    "country": "日本",
    "lat": 34.6827801,
    "lon": 135.829486
  },
  {
    "city": "山梨县南都留郡",
    "country": "日本",
    "lat": 35.4791499,
    "lon": 138.7411672
  },
  {
    "city": "熊本县山鹿市",
    "country": "日本",
    "lat": 33.0177456,
    "lon": 130.6911907
  },
  {
    "city": "熊本县熊本市",
    "country": "日本",
    "lat": 32.7666309,
    "lon": 130.6893688
  },
  {
    "city": "熊本县阿苏市",
    "country": "日本",
    "lat": 32.9524903,
    "lon": 131.1214674
  },
  {
    "city": "爱媛县伊予市",
    "country": "日本",
    "lat": 33.7578962,
    "lon": 132.7039458
  },
  {
    "city": "爱媛县松山市",
    "country": "日本",
    "lat": 33.8395188,
    "lon": 132.7653521
  },
  {
    "city": "神奈川县厚木市",
    "country": "日本",
    "lat": 35.443095,
    "lon": 139.36253
  },
  {
    "city": "神奈川县小田原市",
    "country": "日本",
    "lat": 35.1961527,
    "lon": 139.1344537
  },
  {
    "city": "神奈川县海老名市",
    "country": "日本",
    "lat": 35.4464147,
    "lon": 139.3906427
  },
  {
    "city": "神奈川县箱根町",
    "country": "日本",
    "lat": 35.2323662,
    "lon": 139.1068849
  },
  {
    "city": "神奈川县藤泽市",
    "country": "日本",
    "lat": 35.3773112,
    "lon": 139.4718379
  },
  {
    "city": "福冈县久留米市",
    "country": "日本",
    "lat": 33.3142084,
    "lon": 130.5544986
  },
  {
    "city": "福冈县北九州市",
    "country": "日本",
    "lat": 33.889539,
    "lon": 130.8859097
  },
  {
    "city": "福冈县福冈市",
    "country": "日本",
    "lat": 33.598039,
    "lon": 130.367284
  },
  {
    "city": "群马县高崎市",
    "country": "日本",
    "lat": 36.3220984,
    "lon": 139.0032758
  },
  {
    "city": "茨城县取手市",
    "country": "日本",
    "lat": 35.8937981,
    "lon": 140.0628486
  },
  {
    "city": "茨城县城里町",
    "country": "日本",
    "lat": 36.4796757,
    "lon": 140.3760465
  },
  {
    "city": "茨城县水户市",
    "country": "日本",
    "lat": 36.3659174,
    "lon": 140.4731743
  },
  {
    "city": "长野县轻井泽町",
    "country": "日本",
    "lat": 36.3482938,
    "lon": 138.5969968
  },
  {
    "city": "金边",
    "country": "柬埔寨",
    "lat": 11.5730391,
    "lon": 104.857807
  },
  {
    "city": "梵蒂冈",
    "country": "梵蒂冈",
    "lat": 41.9034912,
    "lon": 12.4528349
  },
  {
    "city": "斯特拉斯堡",
    "country": "法国",
    "lat": 48.584614,
    "lon": 7.7507127
  },
  {
    "city": "曼谷",
    "country": "泰国",
    "lat": 13.7524938,
    "lon": 100.4935089
  },
  {
    "city": "罗永府",
    "country": "泰国",
    "lat": 12.7943716,
    "lon": 101.3705344
  },
  {
    "city": "玛尔摩",
    "country": "瑞典",
    "lat": 55.6052931,
    "lon": 13.0001566
  },
  {
    "city": "卢塞恩",
    "country": "瑞士",
    "lat": 47.0505452,
    "lon": 8.3054682
  },
  {
    "city": "沙夫豪森",
    "country": "瑞士",
    "lat": 47.6960491,
    "lon": 8.634513
  },
  {
    "city": "苏黎世",
    "country": "瑞士",
    "lat": 47.3744489,
    "lon": 8.5410422
  },
  {
    "city": "西雅图",
    "country": "美国",
    "lat": 47.6038321,
    "lon": -122.330062
  },
  {
    "city": "伦敦",
    "country": "英国",
    "lat": 51.5074456,
    "lon": -0.1277653
  },
  {
    "city": "岘港",
    "country": "越南",
    "lat": 16.0715831,
    "lon": 108.2092693
  },
  {
    "city": "胡志明",
    "country": "越南",
    "lat": 10.7763897,
    "lon": 106.7011391
  },
  {
    "city": "迪拜",
    "country": "阿联酋",
    "lat": 34.8229975,
    "lon": 135.5249907
  },
  {
    "city": "阿布扎比阿布扎比",
    "country": "阿联酋",
    "lat": 24.4407588,
    "lon": 54.371427
  },
  {
    "city": "吉隆坡",
    "country": "马来西亚",
    "lat": 3.1526589,
    "lon": 101.7022205
  }
];