// 此文件由 geocode_locations.py 脚本自动生成
// 请勿手动编辑

const myPlaces = [
  {
    "city": "Cambodia, Phnom Penh",
    "lat": 11.5730391,
    "lon": 104.857807
  },
  {
    "city": "Cambodia, Siem Reap",
    "lat": 13.3617562,
    "lon": 103.8590321
  },
  {
    "city": "Denmark, Capital Region of Denmark, Copenhagen",
    "lat": 55.6867243,
    "lon": 12.5700724
  },
  {
    "city": "France, Grand Est, Strasbourg",
    "lat": 48.584614,
    "lon": 7.7507127
  },
  {
    "city": "Germany, Baden-Württemberg, Böblingen",
    "lat": 48.684969,
    "lon": 9.0113444
  },
  {
    "city": "Germany, Baden-Württemberg, Hechingen",
    "lat": 48.3525529,
    "lon": 8.9642047
  },
  {
    "city": "Germany, Baden-Württemberg, Heidelberg",
    "lat": 49.4093582,
    "lon": 8.694724
  },
  {
    "city": "Germany, Baden-Württemberg, Stuttgart",
    "lat": 48.7784485,
    "lon": 9.1800132
  },
  {
    "city": "Germany, Bavaria, Munich",
    "lat": 48.1371079,
    "lon": 11.5753822
  },
  {
    "city": "Germany, Hesse, Frankfurt",
    "lat": 50.1106444,
    "lon": 8.6820917
  },
  {
    "city": "Greece, Attica, Athens",
    "lat": 37.9755648,
    "lon": 23.7348324
  },
  {
    "city": "Indonesia, Batam",
    "lat": 1.1030815,
    "lon": 104.0383696
  },
  {
    "city": "Indonesia, Bintan",
    "lat": 1.0196577,
    "lon": 104.5698189
  },
  {
    "city": "Italy, Lombardy, Milan",
    "lat": 45.4641943,
    "lon": 9.1896346
  },
  {
    "city": "Italy, Rome",
    "lat": 41.8933203,
    "lon": 12.4829321
  },
  {
    "city": "Italy, Tuscany, Florence",
    "lat": 43.7697955,
    "lon": 11.2556404
  },
  {
    "city": "Malaysia, Kuala Lumpur",
    "lat": 3.1526589,
    "lon": 101.7022205
  },
  {
    "city": "Norway, Innlandet, Lillehammer",
    "lat": 61.1333408,
    "lon": 10.4265855
  },
  {
    "city": "Norway, Møre og Romsdal, Ålesund",
    "lat": 62.4802363,
    "lon": 6.5550739
  },
  {
    "city": "Norway, Oslo, Oslo",
    "lat": 59.9723975,
    "lon": 10.7757292
  },
  {
    "city": "Norway, Trøndelag, Trondheim",
    "lat": 63.4304475,
    "lon": 10.3952118
  },
  {
    "city": "Norway, Vestland, Bergen",
    "lat": 60.3943055,
    "lon": 5.3259192
  },
  {
    "city": "Singapore, Singapore",
    "lat": 1.2899175,
    "lon": 103.8519072
  },
  {
    "city": "Sweden, Skåne, Malmö",
    "lat": 55.6052931,
    "lon": 13.0001566
  },
  {
    "city": "Switzerland, Lucerne, Lucerne",
    "lat": 47.0505452,
    "lon": 8.3054682
  },
  {
    "city": "Switzerland, Schaffhausen, Schaffhausen",
    "lat": 47.6960491,
    "lon": 8.634513
  },
  {
    "city": "Switzerland, Valais, Täsch",
    "lat": 46.0676751,
    "lon": 7.7770173
  },
  {
    "city": "Switzerland, Valais, Zermatt",
    "lat": 46.0212076,
    "lon": 7.749254
  },
  {
    "city": "Switzerland, Zurich, Zurich",
    "lat": 47.3744489,
    "lon": 8.5410422
  },
  {
    "city": "Thailand, Bangkok",
    "lat": 13.7524938,
    "lon": 100.4935089
  },
  {
    "city": "Thailand, Rayong",
    "lat": 12.6817905,
    "lon": 101.277765
  },
  {
    "city": "United Arab Emirates, Abu Dhabi, Abu Dhabi",
    "lat": 24.4538352,
    "lon": 54.3774014
  },
  {
    "city": "United Arab Emirates, Abu Dhabi, Al Ain",
    "lat": 24.2248697,
    "lon": 55.7452211
  },
  {
    "city": "United Arab Emirates, Dubai, Dubai",
    "lat": 25.0742823,
    "lon": 55.1885387
  },
  {
    "city": "United Kingdom, England, London",
    "lat": 51.5074456,
    "lon": -0.1277653
  },
  {
    "city": "United States, Washington, Seattle",
    "lat": 47.6038321,
    "lon": -122.330062
  },
  {
    "city": "Vatican City, Vatican City, Vatican City",
    "lat": 41.9008795,
    "lon": 12.4509301
  },
  {
    "city": "Vietnam, Da Nang",
    "lat": 16.068,
    "lon": 108.212
  },
  {
    "city": "Vietnam, Ho Chi Minh City",
    "lat": 10.7763897,
    "lon": 106.7011391
  },
  {
    "city": "中国上海",
    "lat": 31.2312707,
    "lon": 121.4700152
  },
  {
    "city": "中国云南昆明",
    "lat": 25.0363006,
    "lon": 102.7086139
  },
  {
    "city": "中国云南玉溪",
    "lat": 23.0601287,
    "lon": 120.2525889
  },
  {
    "city": "中国内蒙古乌兰察布",
    "lat": 40.9902685,
    "lon": 113.1315646
  },
  {
    "city": "中国内蒙古包头",
    "lat": 40.6174777,
    "lon": 109.944912
  },
  {
    "city": "中国内蒙古呼伦贝尓海拉尔",
    "lat": 49.2100482,
    "lon": 119.7504262
  },
  {
    "city": "中国内蒙古呼伦贝尓满洲里",
    "lat": 49.5841146,
    "lon": 117.44403
  },
  {
    "city": "中国内蒙古鄂尔多斯",
    "lat": 39.4602947,
    "lon": 108.8134284
  },
  {
    "city": "中国内蒙古阿拉善盟",
    "lat": 40.480869,
    "lon": 102.84579
  },
  {
    "city": "中国北京",
    "lat": 40.190632,
    "lon": 116.412144
  },
  {
    "city": "中国台湾台中",
    "lat": 32.1148436,
    "lon": 112.1762685
  },
  {
    "city": "中国台湾台北",
    "lat": 22.2729501,
    "lon": 114.1738292
  },
  {
    "city": "中国台湾台南",
    "lat": 22.2217813,
    "lon": 114.1148867
  },
  {
    "city": "中国台湾基隆",
    "lat": 39.9252939,
    "lon": 119.5698059
  },
  {
    "city": "中国台湾屏东县恒春镇",
    "lat": 22.0017382,
    "lon": 120.7476631
  },
  {
    "city": "中国台湾彰化",
    "lat": 30.3933305,
    "lon": 120.2759866
  },
  {
    "city": "中国台湾新竹",
    "lat": 22.3103098,
    "lon": 114.1908672
  },
  {
    "city": "中国台湾花莲",
    "lat": 22.2794583,
    "lon": 114.19292
  },
  {
    "city": "中国台湾高雄",
    "lat": 30.0918556,
    "lon": 105.5018646
  },
  {
    "city": "中国四川德阳",
    "lat": 32.8569953,
    "lon": 130.7928238
  },
  {
    "city": "中国天津",
    "lat": 39.3032619,
    "lon": 117.4163641
  },
  {
    "city": "中国宁夏银川",
    "lat": 38.4852037,
    "lon": 106.2261926
  },
  {
    "city": "中国安徽合肥",
    "lat": 31.8665676,
    "lon": 117.281428
  },
  {
    "city": "中国安徽宣城",
    "lat": 30.9412541,
    "lon": 118.7540167
  },
  {
    "city": "中国安徽滁州",
    "lat": 32.3027377,
    "lon": 118.3139455
  },
  {
    "city": "中国安徽黄山",
    "lat": 29.7172627,
    "lon": 118.3324811
  },
  {
    "city": "中国广东广州",
    "lat": 23.1301964,
    "lon": 113.2592945
  },
  {
    "city": "中国广东揭阳",
    "lat": 29.0860719,
    "lon": 119.6593357
  },
  {
    "city": "中国广东汕头",
    "lat": 30.4823176,
    "lon": 114.3917779
  },
  {
    "city": "中国广东深圳",
    "lat": 22.5445741,
    "lon": 114.0545429
  },
  {
    "city": "中国广东清远",
    "lat": 22.55212,
    "lon": 107.8310295
  },
  {
    "city": "中国广东珠海",
    "lat": 22.273734,
    "lon": 113.5721327
  },
  {
    "city": "中国广西北海",
    "lat": 21.6740808,
    "lon": 109.3729721
  },
  {
    "city": "中国广西南宁",
    "lat": 22.8193063,
    "lon": 108.3627211
  },
  {
    "city": "中国广西柳州",
    "lat": 25.0009993,
    "lon": 109.3414252
  },
  {
    "city": "中国江苏南京",
    "lat": 32.0438284,
    "lon": 118.7788631
  },
  {
    "city": "中国江苏常州",
    "lat": 31.8122623,
    "lon": 119.9691539
  },
  {
    "city": "中国江苏扬州",
    "lat": 32.3968554,
    "lon": 119.4077658
  },
  {
    "city": "中国江苏无锡",
    "lat": 31.5776626,
    "lon": 120.2952752
  },
  {
    "city": "中国江苏苏州",
    "lat": 31.8665676,
    "lon": 117.281428
  },
  {
    "city": "中国江西上饶",
    "lat": 28.7435852,
    "lon": 117.40539
  },
  {
    "city": "中国江西南昌",
    "lat": 28.6472124,
    "lon": 116.0348483
  },
  {
    "city": "中国江西赣州",
    "lat": 25.703866,
    "lon": 115.348216
  },
  {
    "city": "中国河北唐山",
    "lat": 39.6266589,
    "lon": 118.1407666
  },
  {
    "city": "中国河北张家口",
    "lat": 40.1533225,
    "lon": 118.2978109
  },
  {
    "city": "中国河南洛阳",
    "lat": 34.6367974,
    "lon": 112.3921623
  },
  {
    "city": "中国河南郑州",
    "lat": 34.7448659,
    "lon": 113.4184563
  },
  {
    "city": "中国浙江嘉兴",
    "lat": 30.7474425,
    "lon": 120.7510971
  },
  {
    "city": "中国浙江宁波",
    "lat": 29.8622194,
    "lon": 121.6203873
  },
  {
    "city": "中国浙江杭州",
    "lat": 30.2489634,
    "lon": 120.2052342
  },
  {
    "city": "中国浙江温州",
    "lat": 27.9963899,
    "lon": 120.695345
  },
  {
    "city": "中国浙江湖州",
    "lat": 30.8942995,
    "lon": 120.0851114
  },
  {
    "city": "中国浙江绍兴",
    "lat": 29.9992425,
    "lon": 120.576854
  },
  {
    "city": "中国浙江舟山",
    "lat": 29.9873344,
    "lon": 122.2030363
  },
  {
    "city": "中国海南海口",
    "lat": 20.0462328,
    "lon": 110.1956502
  },
  {
    "city": "中国海南省三亚市",
    "lat": 18.2665551,
    "lon": 109.501877
  },
  {
    "city": "中国湖北宜昌",
    "lat": 30.6941332,
    "lon": 111.2803512
  },
  {
    "city": "中国湖南长沙",
    "lat": 28.1450774,
    "lon": 113.2384362
  },
  {
    "city": "中国澳门",
    "lat": 22.1757605,
    "lon": 113.5514142
  },
  {
    "city": "中国甘肃兰州",
    "lat": 36.474436,
    "lon": 103.733224
  },
  {
    "city": "中国甘肃酒泉",
    "lat": 40.2773513,
    "lon": 96.4560478
  },
  {
    "city": "中国甘肃酒泉敦煌",
    "lat": 40.1411004,
    "lon": 94.6607593
  },
  {
    "city": "中国福建厦门",
    "lat": 24.5438732,
    "lon": 118.0768065
  },
  {
    "city": "中国福建泉州",
    "lat": 25.1901863,
    "lon": 118.338717
  },
  {
    "city": "中国福建金门",
    "lat": 24.4466773,
    "lon": 118.200187
  },
  {
    "city": "中国西藏山南",
    "lat": 28.7628486,
    "lon": 91.7523138
  },
  {
    "city": "中国西藏拉萨",
    "lat": 29.6542054,
    "lon": 91.1173015
  },
  {
    "city": "中国西藏林芝",
    "lat": 29.5487912,
    "lon": 94.6384738
  },
  {
    "city": "中国辽宁沈阳",
    "lat": 41.8026095,
    "lon": 123.4279105
  },
  {
    "city": "中国重庆",
    "lat": 30.05518,
    "lon": 107.8748712
  },
  {
    "city": "中国陕西西安",
    "lat": 34.261004,
    "lon": 108.9423363
  },
  {
    "city": "中国青海海南藏族自治州",
    "lat": 35.8172501,
    "lon": 100.3405266
  },
  {
    "city": "中国青海西宁",
    "lat": 36.824463,
    "lon": 101.440811
  },
  {
    "city": "中国香港",
    "lat": 22.350627,
    "lon": 114.1849161
  },
  {
    "city": "日本东京都东京市",
    "lat": 35.6220104,
    "lon": 139.6496553
  },
  {
    "city": "日本京都府京都市",
    "lat": 35.0421443,
    "lon": 135.730837
  },
  {
    "city": "日本佐贺县唐津市",
    "lat": 33.4503405,
    "lon": 129.9679345
  },
  {
    "city": "日本冲绳县冲绳市",
    "lat": 26.2179409,
    "lon": 127.6828163
  },
  {
    "city": "日本北海道千岁市",
    "lat": 42.8209335,
    "lon": 141.6509612
  },
  {
    "city": "日本北海道占冠村",
    "lat": 42.9799698,
    "lon": 142.3980624
  },
  {
    "city": "日本北海道小樽市",
    "lat": 43.1906806,
    "lon": 140.9946021
  },
  {
    "city": "日本北海道札幌市",
    "lat": 43.0558424,
    "lon": 141.3344281
  },
  {
    "city": "日本千叶县成田市",
    "lat": 35.7767683,
    "lon": 140.3183376
  },
  {
    "city": "日本埼玉县春日部市",
    "lat": 35.9757957,
    "lon": 139.752019
  },
  {
    "city": "日本大阪府大阪市",
    "lat": 34.6782172,
    "lon": 135.5007926
  },
  {
    "city": "日本大阪府茨木市",
    "lat": 34.8200725,
    "lon": 135.5298181
  },
  {
    "city": "日本奈良县奈良市",
    "lat": 34.6827801,
    "lon": 135.829486
  },
  {
    "city": "日本山梨县南都留郡",
    "lat": 35.4791499,
    "lon": 138.7411672
  },
  {
    "city": "日本熊本县山鹿市",
    "lat": 33.0177456,
    "lon": 130.6911907
  },
  {
    "city": "日本熊本县熊本市",
    "lat": 32.7666309,
    "lon": 130.6893688
  },
  {
    "city": "日本熊本县阿苏市",
    "lat": 32.9524903,
    "lon": 131.1214674
  },
  {
    "city": "日本爱媛县伊予市",
    "lat": 33.7578962,
    "lon": 132.7039458
  },
  {
    "city": "日本爱媛县松山市",
    "lat": 33.8395188,
    "lon": 132.7653521
  },
  {
    "city": "日本神奈川县厚木市",
    "lat": 35.443095,
    "lon": 139.36253
  },
  {
    "city": "日本神奈川县小田原市",
    "lat": 35.1961527,
    "lon": 139.1344537
  },
  {
    "city": "日本神奈川县海老名市",
    "lat": 35.4484511,
    "lon": 139.3953456
  },
  {
    "city": "日本神奈川县箱根町",
    "lat": 35.2323662,
    "lon": 139.1068849
  },
  {
    "city": "日本神奈川县藤泽市",
    "lat": 35.3773112,
    "lon": 139.4718379
  },
  {
    "city": "日本福冈县久留米市",
    "lat": 33.3142084,
    "lon": 130.5544986
  },
  {
    "city": "日本福冈县北九州市",
    "lat": 33.889539,
    "lon": 130.8859097
  },
  {
    "city": "日本福冈县福冈市",
    "lat": 33.598039,
    "lon": 130.367284
  },
  {
    "city": "日本群马县高崎市",
    "lat": 36.3220984,
    "lon": 139.0032758
  },
  {
    "city": "日本茨城县取手市",
    "lat": 35.8937981,
    "lon": 140.0628486
  },
  {
    "city": "日本茨城县城里町",
    "lat": 36.4796757,
    "lon": 140.3760465
  },
  {
    "city": "日本茨城县水户市",
    "lat": 36.3659174,
    "lon": 140.4731743
  },
  {
    "city": "日本长野县轻井泽町",
    "lat": 36.3482938,
    "lon": 138.5969968
  }
];